IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_RX2_CONTROLSS_FSI1_RX2.xml
	<register id="CONTROLSS_FSI1_RX2_RX_CRC_INFO" acronym="CONTROLSS_FSI1_RX2_RX_CRC_INFO" offset="0x16" width="16" description="">
		<bitfield id="CALC_CRC" width="8" begin="15" end="8" resetval="0x0" description="Harware Calculated CRC Value This bitfield contains the CRC value that was calculated on the last received data. The contents of this bitfield are valid only when data frames are received.   Note: The contents of this bitfield are invalid for ping and error frames." range="15 - 8" rwaccess="RO"/> 
		<bitfield id="RX_CRC" width="8" begin="7" end="0" resetval="0x0" description="Received CRC Value This bitfield contains the CRC value that was last received a frame. The contents of this bitfield are valid only when data frames are received.   Note: The contents of this bitfield are invalid for ping and error frames." range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_EVT_CLR_ALT1_" acronym="CONTROLSS_FSI1_RX2_RX_EVT_CLR_ALT1_" offset="0x18" width="16" description="">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Glag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="14" rwaccess="WO"/> 
		<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="13" rwaccess="WO"/> 
		<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="12" rwaccess="WO"/> 
		<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="11" rwaccess="WO"/> 
		<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="10" rwaccess="WO"/> 
		<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="9" rwaccess="WO"/> 
		<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="8" rwaccess="WO"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (R/W) = Writing a 0 to this bit will have no effect. 1h (R/W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="7" rwaccess="WO"/> 
		<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="6" rwaccess="WO"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="5" rwaccess="WO"/> 
		<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="4" rwaccess="WO"/> 
		<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="3" rwaccess="WO"/> 
		<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="2" rwaccess="WO"/> 
		<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="1" rwaccess="WO"/> 
		<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag Clear bit This bit clears the corresponding bit in the RX_EVT_STS register.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Writing a 1 to this bit will clear the corresponding bit in the RX_EVT_STS register to 0." range="0" rwaccess="WO"/>
	</register>
