IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_RX2_CONTROLSS_FSI1_RX2.xml
	<register id="CONTROLSS_FSI1_RX2_RX_EVT_FRC_ALT1_" acronym="CONTROLSS_FSI1_RX2_RX_EVT_FRC_ALT1_" offset="0x1A" width="16" description="">
		<bitfield id="ERROR_TAG_MATCH" width="1" begin="14" end="14" resetval="0x0" description="Error Tag Match Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="14" rwaccess="WO"/> 
		<bitfield id="DATA_TAG_MATCH" width="1" begin="13" end="13" resetval="0x0" description="Data Tag Match Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="13" rwaccess="WO"/> 
		<bitfield id="PING_TAG_MATCH" width="1" begin="12" end="12" resetval="0x0" description="Ping Tag Match Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="12" rwaccess="WO"/> 
		<bitfield id="DATA_FRAME" width="1" begin="11" end="11" resetval="0x0" description="Data Frame Received Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="11" rwaccess="WO"/> 
		<bitfield id="FRAME_OVERRUN" width="1" begin="10" end="10" resetval="0x0" description="Frame Overrun Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="10" rwaccess="WO"/> 
		<bitfield id="PING_FRAME" width="1" begin="9" end="9" resetval="0x0" description="Ping Frame Received Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="9" rwaccess="WO"/> 
		<bitfield id="ERR_FRAME" width="1" begin="8" end="8" resetval="0x0" description="Error Frame Received Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="8" rwaccess="WO"/> 
		<bitfield id="BUF_UNDERRUN" width="1" begin="7" end="7" resetval="0x0" description="Receive Buffer Underrun Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="7" rwaccess="WO"/> 
		<bitfield id="FRAME_DONE" width="1" begin="6" end="6" resetval="0x0" description="Frame Done Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="6" rwaccess="WO"/> 
		<bitfield id="BUF_OVERRUN" width="1" begin="5" end="5" resetval="0x0" description="Receive Buffer Overrun Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="5" rwaccess="WO"/> 
		<bitfield id="EOF_ERR" width="1" begin="4" end="4" resetval="0x0" description="End-of-Frame Error Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="4" rwaccess="WO"/> 
		<bitfield id="TYPE_ERR" width="1" begin="3" end="3" resetval="0x0" description="Frame Type Error Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="3" rwaccess="WO"/> 
		<bitfield id="CRC_ERR" width="1" begin="2" end="2" resetval="0x0" description="CRC Error Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="2" rwaccess="WO"/> 
		<bitfield id="FRAME_WD_TO" width="1" begin="1" end="1" resetval="0x0" description="Frame Watchdog Timeout Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="1" rwaccess="WO"/> 
		<bitfield id="PING_WD_TO" width="1" begin="0" end="0" resetval="0x0" description="Ping Watchdog Timeout Flag Force bit This bit will cause the corresponding bit in the RX_EVT_STS register to get set. The purpose of this register is to allow software to simulate the effect of the event and test the associated software/ISR.  0h (W) = Writing a 0 to this bit will have no effect. 1h (W) = Force the corresponding bit in the RX_EVT_STS Register." range="0" rwaccess="WO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_BUF_PTR_LOAD" acronym="CONTROLSS_FSI1_RX2_RX_BUF_PTR_LOAD" offset="0x1C" width="16" description="">
		<bitfield id="BUF_PTR_LOAD" width="4" begin="3" end="0" resetval="0x0" description="Buffer Pointer Load. This is the value to be loaded into the receive word pointer when written. This is to allow software to force the receiver to start storing the received data starting at a specific location in the buffer.   NOTE: The value of the CURR_BUF_PTR in the RX_BUF_PTR_STS will not get reflected immediately. This will take effect only when there is a valid receive operation with incoming clocks after (3 RXCLK + 3 SYCLK) cycles." range="3 - 0" rwaccess="RW"/>
	</register>
