IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_RX2_CONTROLSS_FSI1_RX2.xml
	<register id="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_0" acronym="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_0" offset="0x58" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_TRIG_WIDTH_0" acronym="CONTROLSS_FSI1_RX2_RX_TRIG_WIDTH_0" offset="0x5C" width="32" description="">
		<bitfield id="RX_TRIG_WIDTH" width="16" begin="15" end="0" resetval="0x0" description="This register decides the width(in SYSCLK cycles) of wide pulse output of the RX trigger module." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_DLYLINE_CTRL" acronym="CONTROLSS_FSI1_RX2_RX_DLYLINE_CTRL" offset="0x60" width="16" description="">
		<bitfield id="RXD1_DLY" width="5" begin="14" end="10" resetval="0x0" description="Delay Line Tap Select for RXD1 This bitfield selects the number of delay elements inserted into the RXD1 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the RXD1 path. RXD1 is taken directly from the pin. 1h (R/W) One delay element is included in the RXD1 path. 2h (R/W) Two delay elements are included in the RXD1 path. ... 1Fh (R/W) 31 delay elements are included in the RXD1 path, the maximum." range="14 - 10" rwaccess="RW"/> 
		<bitfield id="RXD0_DLY" width="5" begin="9" end="5" resetval="0x0" description="Delay Line Tap Select for RXD0 This bitfield selects the number of delay elements inserted into the RXD0 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the RXD0 path. RXD0 is taken directly from the pin. 1h (R/W) One delay element is included in the RXD0 path. 2h (R/W) Two delay elements are included in the RXD0 path. ... 1Fh (R/W) 31 delay elements are included in the RXD0 path, the maximum." range="9 - 5" rwaccess="RW"/> 
		<bitfield id="RXCLK_DLY" width="5" begin="4" end="0" resetval="0x0" description="Delay Line Tap Select for RXCLK This bitfield selects the number of delay elements inserted into the RXCLK path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the RXCLK path. RXCLK is taken directly from the pin. 1h (R/W) One delay element is included in the RXCLK path. 2h (R/W) Two delay elements are included in the RXCLK path. ... 1Fh (R/W) 31 delay elements are included in the RXCLK path, the maximum." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_1" acronym="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_1" offset="0x64" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_2" acronym="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_2" offset="0x68" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_3" acronym="CONTROLSS_FSI1_RX2_RX_TRIG_CTRL_3" offset="0x6C" width="32" description="">
		<bitfield id="RX_TRIG_DLY" width="24" begin="31" end="8" resetval="0x0" description="This is the 24 bit count of the trigger delay in SYSCLK cycles. If enabled, the Trigger-1 output of the trigger module will generate a 3 SYSCLK wide trigger pulse after the selected input trigger source sees a rising edge with a delay defined by this 24-bt value." range="31 - 8" rwaccess="RW"/> 
		<bitfield id="TRIG_SEL" width="4" begin="4" end="1" resetval="0x0" description="This is the mux select value which selects which of the inputs will be used as the trigger source." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="TRIG_EN" width="1" begin="0" end="0" resetval="0x0" description="This is the enable for the RX output trigger generation. The output triggers will be generated only if this bit is set to 1. If this bit is 0, then no trigger will be generated by this module." range="0" rwaccess="RW"/>
	</register>
