IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI1_RX2_CONTROLSS_FSI1_RX2.xml
	<register id="CONTROLSS_FSI1_RX2_RX_VIS_1" acronym="CONTROLSS_FSI1_RX2_RX_VIS_1" offset="0x70" width="32" description="">
		<bitfield id="RX_CORE_STS" width="1" begin="3" end="3" resetval="0x0" description="Receiver Core Status bit This bit indicates the status of the receiver core. If this bit is set, the receiver should undergo a reset and subsequent resynchronization with the transmitter. This bit will be always be set when the receiver has detected and end of frame error or a frame type error. This bit can also be set if the receiver becomes corrupted due to noise on the signal lines. If the receiver has experienced a ping watchdog or frame watchdog timeout, this bit should be read to determine if the cause was due to a corrupt transaction, thus putting the receiver core into an unrecoverable state.  Only a soft reset will reset the recevier core and thus reset this bit.  0h (R) The receiver core is operating normally. 1h (R) The receiver core has entered into an error state and should be reset." range="3" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_UDATA_FILTER" acronym="CONTROLSS_FSI1_RX2_RX_UDATA_FILTER" offset="0x74" width="16" description="">
		<bitfield id="UDATA_MASK" width="8" begin="15" end="8" resetval="0x0" description="Bit Mask to be used for comparing the USERDATA field when filtering is enabled. Every bit that is '1' in this register will be masked for comparison. If a bit position is '1', then it will be considered a successful match for that bit position." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="UDATA_REG" width="8" begin="7" end="0" resetval="0x0" description="Reference to be used for comparing the USERDATA field when filtering is enabled." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI1_RX2_RX_BUF_BASE" acronym="CONTROLSS_FSI1_RX2_RX_BUF_BASE" offset="0x80" width="16" description="">
		<bitfield id="BASE_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="Receive Data Buffer Base Address This is the base address of the 16-word data buffer used by the receiver." range="15 - 0" rwaccess="RO"/>
	</register>
</module>